[
{"title": "“Pirojektonni sababa rakkoo nageenyaan addaan citanii turan gara hojiitti deebi’aniiru”- Bulchiinsa godina Wallagga Bahaa", "summary": ""},
{"title": "Warshaa socho’aan bu’aalee qonnaa qindeessu omisham", "summary": "Finfinnee: Ardiiwwan mararraa dubartoota addunyaa dirree tokkorratti kan walitti fidu walmorkiin waancaa kubbaa miilaa guddattootaa addunyaa ALA..."},
{"title": "Abbootiin amantaa Ergaa Baga ayyaana du’aa ka’uu bara 2016 geessaanii dabrsan", "summary": "Nagaafi araarri ergaa dhoksaa guyyichaa ta’uus ibsan Finfinnee: Abbootiin amantaa Kiristaanaa hordoftoota amantichaa biyya keessaafi ala jiran maraaf baga ayyaana Du’aa Ka’uu Yesuus Kiristoos bara 2016 nagaan isin gahe jechuun ergaa dabarsan...."},
{"title": "Ayyaana irreechaa baranaarratti gatiin meeshaaleefi uffata aadaa Oromoo dabaleera", "summary": ""},
{"title": "Sosochii omishtoota dadammaqse", "summary": "Erga yaadamniifi kaka’umsi, ‘Itoophiyaan haa omishtu’ jedhamu, eegalamee as, sosochiin indastirii manifaakchariingii manifaakchariingii akka biyyaatti jalqabame daran jajjabeessaadha. Indastirii manifaakchariingii akka toora xiyyeeffannoo tokkootti qabachuufi dilbiifi carraawwan gama kanaan jiran adda baasanii..."},
{"title": "Dayaasporaan Oromoo ayyaana Irreechaa aantummaan hirmaataa jira", "summary": "Finfinnee: Kabaja ayyaana Irreechaa baranaan walqabatee gatiin meeshaaleefi uffata aadaa Oromoo hanga tokko dabaluu daldaltoonni damichaa baazaariifi egizibishinii Irreechaa Giddugala Aadaa Oromoorratti hirmaatan ibsan. Oromoon saba meeshaaleefi uffata aadaa mataasaa qabuudha. Dhalootni..."},
{"title": "Labsii nageenyaa Naqamteerraa labsame", "summary": ""},
{"title": "Itoophiyaa waggoota15 dhufanitti jiddugalaAviyeeshinii taasisuufhojjetamaa jira", "summary": ""},
{"title": "Du’aa ka’uu: Fakkeenya jaalalaafi garraamummaa", "summary": "Ummata bira dhaqaniis ta’e gara waajjirasaaniitti affeeranii mariisisuun, yaadota biyya ceessisan, maddisiisuun harkaafi sammuu qulqulluudhaan hojiirra oolchuun, biyya qarree diigamaarra turte baraaruun, hawaasa seenessa qeenxeetiin burjaajii adda addaa keessa ture yaadasaa jijjiiruun,..."},
{"title": "Hojiin Oromiyaa galaana dammaa taasisuuf eegalame bu’aaqabeessa", "summary": "Finfinnee: Dayaasporaan Oromoo kabaja ayyaana irreechaa biyya keessaafi alaatti hirmaannaa ho’aa taasisaa jiraachuun ibsame. Dura Taa’aa Ittaanaan Waldaa Dayaasporaa Itoophiyaa Obbo Dammaqaa Nagaasaa Roobii darbe Dhaabbata Pireesii Itoophiyaaf akka ibsanitti, dayaasporaa hedduun..."},
{"title": "Dhaloota kanaaf ajandaan waggaa 50 nagaa waaraa ta’uu qaba", "summary": ""},
{"title": "“Dhalootni Duudhaa ganamaatti deebi’uu qaba” -Abbaa Gadaa Warqinaa Tarreessaa", "summary": ""},
{"title": "Karaan nagaa yeroo hunda bu’aa qabeessa", "summary": "Akka amantaa Kiristaanaatti fannoo booda otoo du’aa ka’uun jiraachuu baatee amantichi hinjiraatu ture. Imalli dhumaa Yesuus lafa kanarratti taasise seenaa gaddisiisaa ta’ee hafaayyu. Abdiin dhala namaas nidukkanaa’a ture. Garuu du’aa ka’uun misiraachoo..."},
{"title": "Bara 2016tti ilaacha ofittummaa keessaa baanee akka biyyaatti yaaduufi hojjechuutu barbaachisa", "summary": "Itoophiyaa waggoota 15 dhufanitti jiddugala Aviyeeshinii taasisuuf hojjetamaa jiraachuu deetaan Ministira Geejibaafi Loojistikii obbo Dhengee Boruu beeksisan. Itoophiyaatti Agarsiifni jalqabaa Innooveeshinii Aviyeeshinii baatii Onkoloolessa dhufu gaafa guyyaa 13 -17/2016tti Finfinnee golambaa Saayinsiitti..."},
{"title": "Nageenya waaraaf harka nagaaf diriiretti fayyadamuu", "summary": ""},
{"title": "Goobeefi Shinooyyee galmee Yuneeskoorratti galmeessisuuf hojjetamaa jira", "summary": ""},
{"title": "Birraa makarachuuf qonna arfaasaatiif xiyyeeffannaa", "summary": "Itoophiyaan seenaa mootummaa bara dheeraa keessatti garaagarummaa siyaasaa, waldhabdeefi walitti bu’iinsota karaa nagaa, mariifi waldhaggeeffachuun hiikuurratti muuxannoo hinqabdu. Akka carraa ta’ee siyaasnishee siyaasa yeroo hunda zeeroorraa jalqabuudha. Biyyanatti kan barame kan humnaan..."},
{"title": "“Adaamaa giddugalawaa hundaa gochuuf hojjetaa jirra”", "summary": "Dhaadannoo “Oromiyaa Galaana Dammaa ni taasisna” jedhuun hojiin inisheetivii misooma dammaatiin jalqabne bu’aa jajjabeessaa argamsisuu jalqabeera. Bu’aan Omisha Dammaarratti arganne kana caalaa yoo asirratti hojjenne dinagdee keenya jajjabeessuun carraa hojii lammiilee hedduuf..."},
{"title": "Milkaa’inoota argaman eegaa jijjiiramicha waaressuu", "summary": ""},
{"title": "“Raayyaan Ittisa Biyyaa bakka rakkoon nageenyaa mudate hundatti argamuun dirqama miti”", "summary": ""},
{"title": "Gamtaadhaan dandeenyeerra", "summary": "“Ummataaf dhaabanna jennee manaa baanee ummata mataarra dhaabanne. Maqaa ummataatiin baanee garuu gocha keenyaan waan ummataaf hinmallee raawwanne, waan safuu cabse qaanii malee raawwanna, maallaqaaf nama ugguruu, dhumarratti garuu maallaqas namas hinhambifne...."},
{"title": "Nageenyi waaraan akka mirkanaa’uuf aadaa siyaasaa keenya jijjiiruu", "summary": ""},
{"title": "Oromiyaatti kompostiin idilee meetirkuubiin miliyoona 155 qophaa’e", "summary": "Finfinnee: Oromiyaatti ji’oota saglan darbanitti kompostiin idilee meetirkuubiin miliyoona 155 qophaa’uu Biiroon Qonna Naannichaa beeksise. Biirichatti Daarektarri Fooyya’iinsa Gabbina Biyyee Obbo Isheetuu Laggasaa ibsa Roobii darbe Gaazexaa Bariisaaf kennaniin akka jedhanitti, naannichatti..."},
{"title": "Shaashamannee akkuma Finfinnee misooma kooriidarii eegalte", "summary": ""},
{"title": "Qorichiifi meeshaaleen wal’aansa fayyaa qarshii biliyoona afurii Tigraayitti ergamaniiru", "summary": "Shaashamannee: Shaashamanneen akkuma Finfinnee misooma kooriidarii eegaluu bulchiinsi magaalattii beeksise. Kantiibaan magaalattii Obbo Adaanaa Taklagiyoorgis Wiixata darbe Gaazeexaa Bariisaaf akka ibsanitti, inisheetivii misooma kooriidarii Ministirri Muummee Doktar Abiyyi Ahmad kallattii kaa’an hordofee..."},
{"title": "Oromiyaatti kompostiin idilee meetirkuubiin miliyoona 155 qophaa’e", "summary": "Finfinnee: Oromiyaatti ji’oota saglan darbanitti kompostiin idilee meetirkuubiin miliyoona 155 qophaa’uu Biiroon Qonna Naannichaa beeksise. Biirichatti Daarektarri Fooyya’iinsa Gabbina Biyyee Obbo Isheetuu Laggasaa ibsa Roobii darbe Gaazexaa Bariisaaf kennaniin akka jedhanitti, naannichatti..."},
{"title": "Milkaa’ina Itoophiyaa Qulqulluuf lammiileen hundi hirmaannaa taasisuu qabu", "summary": ""},
{"title": "Shaashamannee akkuma Finfinnee misooma kooriidarii eegalte", "summary": ""},
{"title": "Barana sadarkaa biyyaatti biqiltuun biliyoona   7.5 akka dhaabamu ibsame", "summary": "Finfinnee: Waliigaltee Piritooriyaa booda qorichootaafi meeshaaleen wal’aansa fayyaa qarshii biliyoona afuritti tilmaamaman gara naannichaatti ergamuu Biiroon Fayyaa Naannoo Tigraay ibse. Hogganaan biirichaa Doktar Amaanu’eel Hayilee Roobii darbe Gaazexaa Bariisaaf akka ibsanitti, sababa..."},
{"title": "Qorichiifi meeshaaleen wal’aansa fayyaa qarshii biliyoona afurii Tigraayitti ergamaniiru", "summary": "Shaashamannee: Shaashamanneen akkuma Finfinnee misooma kooriidarii eegaluu bulchiinsi magaalattii beeksise. Kantiibaan magaalattii Obbo Adaanaa Taklagiyoorgis Wiixata darbe Gaazeexaa Bariisaaf akka ibsanitti, inisheetivii misooma kooriidarii Ministirri Muummee Doktar Abiyyi Ahmad kallattii kaa’an hordofee..."},
{"title": "Dhaabbileen mootummaa fedaraalaa hundi karaa elektirooniksii bittaa eegalan", "summary": ""},
{"title": "Milkaa’ina Itoophiyaa Qulqulluuf lammiileen hundi hirmaannaa taasisuu qabu", "summary": ""},
{"title": "Ji’oota kurnan darbanitti galiin qarshii biliyoonni 425 ol sassaabame", "summary": "Finfinnee: Milkaa’ina Itoophiyaa Qulqulluuf lammiileen hundi hirmaannaa taasisuun dirqama lammummaa ba’uu akka qaban Hospitaala Kollejjii Miliniyeemii Paawulositti Ispeeshaalistiin Xinsammuu Doktar Solomoon ibsan. Doktar Solomoon sosochii Itoophiyaa Qulqulluu ilaalchisee Kamisa darbe Gaazexaa Bariisaaf..."},
{"title": "Barana sadarkaa biyyaatti biqiltuun biliyoona   7.5 akka dhaabamu ibsame", "summary": "Finfinnee: Waliigaltee Piritooriyaa booda qorichootaafi meeshaaleen wal’aansa fayyaa qarshii biliyoona afuritti tilmaamaman gara naannichaatti ergamuu Biiroon Fayyaa Naannoo Tigraay ibse. Hogganaan biirichaa Doktar Amaanu’eel Hayilee Roobii darbe Gaazexaa Bariisaaf akka ibsanitti, sababa..."},
{"title": "Zooniin Dinagdee Addaa guddina dinagdee si’eessuuf shoora olaanaa qaba", "summary": ""},
{"title": "Dhaabbileen mootummaa fedaraalaa hundi karaa elektirooniksii bittaa eegalan", "summary": ""},
{"title": "“Pirojektonni sababa rakkoo nageenyaan addaan citanii turan gara hojiitti deebi’aniiru”- Bulchiinsa godina Wallagga Bahaa", "summary": "Lafti biqilaan dhaabbatu hektaarri miliyoona 1.8 qophaa’eera Finfinnee: Sagantaa Ashaaraa Magariisaa baranaatiin biqiltuu biliyoona 7.5 dhaabuuf karoorfamee hojjetamaa jiraachuu Koreen Teeknikii Ashaaraa Magariisaa Biyyaalessaa ibse. Sadarkaa biyyaattis Waxabajjii 22 akka eegaluuf murtaa’ee..."},
{"title": "Ji’oota kurnan darbanitti galiin qarshii biliyoonni 425 ol sassaabame", "summary": "Finfinnee: Milkaa’ina Itoophiyaa Qulqulluuf lammiileen hundi hirmaannaa taasisuun dirqama lammummaa ba’uu akka qaban Hospitaala Kollejjii Miliniyeemii Paawulositti Ispeeshaalistiin Xinsammuu Doktar Solomoon ibsan. Doktar Solomoon sosochii Itoophiyaa Qulqulluu ilaalchisee Kamisa darbe Gaazexaa Bariisaaf..."},
{"title": "Warshaa socho’aan bu’aalee qonnaa qindeessu omisham", "summary": ""},
{"title": "Zooniin Dinagdee Addaa guddina dinagdee si’eessuuf shoora olaanaa qaba", "summary": ""},
{"title": "“Pirojektonni sababa rakkoo nageenyaan addaan citanii turan gara hojiitti deebi’aniiru”- Bulchiinsa godina Wallagga Bahaa", "summary": "Lafti biqilaan dhaabbatu hektaarri miliyoona 1.8 qophaa’eera Finfinnee: Sagantaa Ashaaraa Magariisaa baranaatiin biqiltuu biliyoona 7.5 dhaabuuf karoorfamee hojjetamaa jiraachuu Koreen Teeknikii Ashaaraa Magariisaa Biyyaalessaa ibse. Sadarkaa biyyaattis Waxabajjii 22 akka eegaluuf murtaa’ee..."},
{"title": "Warshaa socho’aan bu’aalee qonnaa qindeessu omisham", "summary": ""},
{"title": "Sababiin malaammaltummaa maali?", "summary": "Gaaffii kanaaf namoonni deebii hedduu kennu. Baay’een qorannoowwan gara garaa dubbisuun tarii sababiin malaammaltummaa mootummaadha jedhu. Kaanis haala jirutu akka malaammaltummaan dagaage taasise jedhanii yaadu. Namni tokko Hiindiitii kan inni deebise isaan..."},
{"title": "", "summary": ""},
{"title": "Milkaa’inni carraa otoo hintaane hojiidhaan dhufa", "summary": "Jalqaba jaarraa 19ffaa keessa biyya Beeljiyeemitti mucaan maqaan isaa Adoolfi Saaksi (Adolphe Sax) jedhamu tokko dhalate. Mucaan kun namoota biyya lafaa kana irratti dhalatan hundumaa caalaa nama milkii hinqabne, nama rakkoof dhalate..."},
{"title": "Ilaalchi mo’amaan utuu hineegaliin nama kuffisa", "summary": ""},
{"title": "Dhoksaa namoota jijjiiramaa", "summary": "Milkaa’ina namoonni hundi nibarbaadu. Haa ta’u malee milkaa’inni maali? Attamitti gonfatama? Eenyutu milkaa’a? Gaaffiilee kanneeniifi kkfn hedduun keenya danqamuu dandeenya. Milkaa’inni jabaatanii hojjechuun malee akka ayyaanaa akka tasaa kan nama irra qubatu,..."},
{"title": "Aariirraa of eeguu", "summary": ""},
{"title": "Ulfa baasuun daqiiqaa muraasa; gaabbiin isaa kan bara baraati", "summary": "Namni hundumtuu darbee darbee yeroo ofitti amanamummaa dhabu, waa’een ofii isaatii waan gaariin yeroo itti dhaga’amuu didu ni jiraata. Jireenyi akkasii yeroo oolee bulu amala namaa dhuunfachaa deemuun gara dhukkuba sammuutti nama..."},
{"title": "Teknolojii intarneetii", "summary": ""},
{"title": "Karoora qabaadhu!", "summary": "Yeroo waa’een jijjiiramaa ka’u namoonni akka Roozaa Paarki ni yaadatamu jedheen yaada. Yeroo namoonni namummaa isaaniin utuu hinta’in bifa gogaa isaanii irratti hundaa’uun gadi qabamaa turan keessatti nama mataa jabaattee haala firoottan..."},
{"title": "Gaggeessaa dhiibbaa gaarii uumu", "summary": ""}
]