[
    {"title": "Shaggaritti rakkoolee bulchiinsa gaarii 612f furmaatni kenname", "summary": ""},
    {"title": "Oromiyaatti sagantaa Ashaaraa Magariisaan biqiltuu muduraa miliyoona 350 dhaabuuf karoorfame", "summary": "Finifinnee: Afrikaa Kibbaa, magaalaa Darbaanitti dorgommii yaadannoo pirezidaantii duraanii biyyattii, Maandeellaaf qophaa’erratti hirmaachuudhaan Kibxata darbe gara biyyaatti..."},
    {"title": "Ayyaana irreechaa baranaarratti gatiin meeshaaleefi uffata aadaa Oromoo dabaleera", "summary": "Finfinnee: Kabaja ayyaana Irreechaa baranaan walqabatee gatiin meeshaaleefi uffata aadaa Oromoo hanga tokko dabaluu daldaltoonni damichaa baazaariifi egizibishinii Irreechaa Giddugala Aadaa Oromoorratti hirmaatan ibsan. Oromoon saba meeshaaleefi uffata aadaa mataasaa qabuudha. Dhalootni..."},
    {"title": "Dayaasporaan Oromoo ayyaana Irreechaa aantummaan hirmaataa jira", "summary": ""},
    {"title": "Itoophiyaa waggoota15 dhufanitti jiddugalaAviyeeshinii taasisuufhojjetamaa jira", "summary": "Finfinnee: Dayaasporaan Oromoo kabaja ayyaana irreechaa biyya keessaafi alaatti hirmaannaa ho’aa taasisaa jiraachuun ibsame. Dura Taa’aa Ittaanaan Waldaa Dayaasporaa Itoophiyaa Obbo Dammaqaa Nagaasaa Roobii darbe Dhaabbata Pireesii Itoophiyaaf akka ibsanitti, dayaasporaa hedduun..."},
    {"title": "Hojiin Oromiyaa galaana dammaa taasisuuf eegalame bu’aaqabeessa", "summary": ""},
    {"title": "“Dhalootni Duudhaa ganamaatti deebi’uu qaba” -Abbaa Gadaa Warqinaa Tarreessaa", "summary": "Itoophiyaa waggoota 15 dhufanitti jiddugala Aviyeeshinii taasisuuf hojjetamaa jiraachuu deetaan Ministira Geejibaafi Loojistikii obbo Dhengee Boruu beeksisan. Itoophiyaatti Agarsiifni jalqabaa Innooveeshinii Aviyeeshinii baatii Onkoloolessa dhufu gaafa guyyaa 13 -17/2016tti Finfinnee golambaa Saayinsiitti..."},
    {"title": "Bara 2016tti ilaacha ofittummaa keessaa baanee akka biyyaatti yaaduufi hojjechuutu barbaachisa", "summary": ""},
    {"title": "Goobeefi Shinooyyee galmee Yuneeskoorratti galmeessisuuf hojjetamaa jira", "summary": "Dhaadannoo “Oromiyaa Galaana Dammaa ni taasisna” jedhuun hojiin inisheetivii misooma dammaatiin jalqabne bu’aa jajjabeessaa argamsisuu jalqabeera. Bu’aan Omisha Dammaarratti arganne kana caalaa yoo asirratti hojjenne dinagdee keenya jajjabeessuun carraa hojii lammiilee hedduuf..."},
    {"title": "“Adaamaa giddugalawaa hundaa gochuuf hojjetaa jirra”", "summary": ""},
    {"title": "“Raayyaan Ittisa Biyyaa bakka rakkoon nageenyaa mudate hundatti argamuun dirqama miti”", "summary": "Taammiruu Raggaasaatiin Finfinnee: Itoophiyaa keessatti waliin jireenyi sabaafi sablammootaa akka dhugoomuuf dhalootni amma jiru duudhaa ganamaatti deebi’uu akka qabu Abbaan Gadaa Maccaa Warqinaa Tarreessaa gaafatan. Akka isaan jedhanitti, Itoophiyaan biyya sabdaneessummaan keessatti..."},
    {"title": "Oromiyaatti bunni biliyoona 1.4 ol dhaabame", "summary": ""},
    {"title": "Dhaloota kanaaf ajandaan waggaa 50 nagaa waaraa ta’uu qaba", "summary": "Itoophiyaan seenaa mootummaa bara dheeraa keessatti garaagarummaa siyaasaa, waldhabdeefi walitti bu’iinsota karaa nagaa, mariifi waldhaggeeffachuun hiikuurratti muuxannoo hinqabdu. Akka carraa ta’ee siyaasnishee siyaasa yeroo hunda zeeroorraa jalqabuudha. Biyyanatti kan barame kan humnaan..."},
    {"title": "Karaan nagaa yeroo hunda bu’aa qabeessa", "summary": ""},
    {"title": "Nageenya waaraaf harka nagaaf diriiretti fayyadamuu", "summary": "“Ummataaf dhaabanna jennee manaa baanee ummata mataarra dhaabanne. Maqaa ummataatiin baanee garuu gocha keenyaan waan ummataaf hinmallee raawwanne, waan safuu cabse qaanii malee raawwanna, maallaqaaf nama ugguruu, dhumarratti garuu maallaqas namas hinhambifne...."},
    {"title": "Birraa makarachuuf qonna arfaasaatiif xiyyeeffannaa", "summary": ""},
    {"title": "Milkaa’inoota argaman eegaa jijjiiramicha waaressuu", "summary": "Waamicha nageenyaa mootummaa jijjiiramaatiin taasifameen paartiileen siyaasaa qabsoo hidhannoo taasisaa turan hedduun karaa nagaa socho’uuf gara biyyaa galanis murni akkuma biyya galeen bosonatti maqe, Shaneen walqabatee dararamni Oromiyaa keessatti lammiilee nagaarratti raawwatame..."},
    {"title": "Gamtaadhaan dandeenyeerra", "summary": ""},
    {"title": "Nageenyi waaraan akka mirkanaa’uuf aadaa siyaasaa keenya jijjiiruu", "summary": "Amma tibba arfaasaa keessa jirra. Bitootessi, Ebliifi Caamsaan waqtii arfaasaa keessatti ramadamu. Akka gannaa ta’uu baatus, akka zoonii qilleensaa biyyi keenya itti argamtuutti, yeroon kun yeroo roobaati. Arfaasaa nirooba; midhaantu facaafama; margis..."},
    {"title": "Tarkaanfii cimee ittifufuu qabu", "summary": ""},
    {"title": "Dubartoota haa ga’oomsinu, misoomaafi nageenya haamirkaneessinu", "summary": "Seenaa Itoophiyaa keessatti Bitootessi 24, guyyaa seenaqabeessa mootummaan jijjiiramaa gara aangootti dhufeefi dhagaan bu’uuraa ijaarsa Laga Abbayyaa itti kaa’ameedha. Jijjiiramaa as yaada Ministirri Muummee Doktar Abiyyi Ahmad maddisiisaniin pirojektonni guguddoon maqaa biyyattii..."},
    {"title": "Miira injifannoo Adwaatiin nageenyaafi misoomaan Adwaa biraa galmeessisuu", "summary": ""},
    {"title": "Shaggaritti rakkoolee bulchiinsa gaarii 612f furmaatni kenname", "summary": "Shaggar: Magaalaa Shaggaritti rakkoo bulchiinsa gaarii kenna tajaajilaan walqabatan 1094 adda ba’an keessaa 612n furmaata argachuu Waajjirri Pablik Sarvisii Magaalaa Shaggar ibse Ittigaafatamaan waajjirichaa Obbo Cammaraa Shibbiruu ibsa tibbana Dhaabbata Pireesii Itoophiyaaf..."},
    {"title": "Oromiyaatti sagantaa Ashaaraa Magariisaan biqiltuu muduraa miliyoona 350 dhaabuuf karoorfame", "summary": ""},
    {"title": "“Shaneen waan ummata biratti fudhatama dhabeefi socho’uufillee rakkateef harka kennataa jira” – Raayyaa ittisa biyyaa", "summary": "Finfinnee: Naannoo Oromiyaatti sagantaa Ashaaraa Magariisaa bara kanaatiin biqiltuu muduraa miliyoona 350 dhaabuuf kan karoorfame ta’uu Biiroon Qonna Oromiyaa beeksise. Biirichatti daarektarri Misooma Muduraa Obbo Tagany Irranaa tibba darbe Dhaabbata Pireesii Itoophiyaaf..."},
    {"title": "Shaggaritti rakkoolee bulchiinsa gaarii 612f furmaatni kenname", "summary": "Shaggar: Magaalaa Shaggaritti rakkoo bulchiinsa gaarii kenna tajaajilaan walqabatan 1094 adda ba’an keessaa 612n furmaata argachuu Waajjirri Pablik Sarvisii Magaalaa Shaggar ibse Ittigaafatamaan waajjirichaa Obbo Cammaraa Shibbiruu ibsa tibbana Dhaabbata Pireesii Itoophiyaaf..."},
    {"title": "Sagantaa Inisheetivii Itoophiyaan haa omishtuutiin Oromiyaatti bu’aalee guguddoon galmaa’aa jiru", "summary": ""},
    {"title": "Oromiyaatti sagantaa Ashaaraa Magariisaan biqiltuu muduraa miliyoona 350 dhaabuuf karoorfame", "summary": ""},
    {"title": "Waamichi komishinichi dhiyeesse marii aadaa taasisuuf shoora olaanaa qaba", "summary": "Maqaa qabsootiin ummata dawoo godhachuun yakka saamichaafi ajjeechaa raawwataa kan ture gareen shorokeessaa Shanee gocha shorokeessummaasaatiin ummata biratti fudhatama dhabuu bira darbee socho’uufillee waan rakkateef harka kennataa jiraachuu raayyaan ittisa biyyaa beeksise...."},
    {"title": "“Shaneen waan ummata biratti fudhatama dhabeefi socho’uufillee rakkateef harka kennataa jira” – Raayyaa ittisa biyyaa", "summary": "Finfinnee: Naannoo Oromiyaatti sagantaa Ashaaraa Magariisaa bara kanaatiin biqiltuu muduraa miliyoona 350 dhaabuuf kan karoorfame ta’uu Biiroon Qonna Oromiyaa beeksise. Biirichatti daarektarri Misooma Muduraa Obbo Tagany Irranaa tibba darbe Dhaabbata Pireesii Itoophiyaaf..."},
    {"title": "Abjuu qoqqooddotaa tokkummaan maseensuu", "summary": ""},
    {"title": "Sagantaa Inisheetivii Itoophiyaan haa omishtuutiin Oromiyaatti bu’aalee guguddoon galmaa’aa jiru", "summary": ""},
    {"title": "Oromiyaatti jijjiiramaa as barnoota cimsuuf qarshii biliyoona 106 ol baasii ta’eera", "summary": "Adaamaa: Sagantaan sosochii Industirii Manifaakchariingii mata duree ‘Itoophiyaan haa omishtu nutis haa binnu’ jedhuun Kibxata darbe Adaamaa, Galma Abbaa Gadaatti adeemsifameera. Waltajjicharratti hoggantoonni sektaroota invastimantiifi industirii mootummaa naannoo Oromiyaafi federaalaa akkasumas qooda..."},
    {"title": "Waamichi komishinichi dhiyeesse marii aadaa taasisuuf shoora olaanaa qaba", "summary": "Maqaa qabsootiin ummata dawoo godhachuun yakka saamichaafi ajjeechaa raawwataa kan ture gareen shorokeessaa Shanee gocha shorokeessummaasaatiin ummata biratti fudhatama dhabuu bira darbee socho’uufillee waan rakkateef harka kennataa jiraachuu raayyaan ittisa biyyaa beeksise...."},
    {"title": "Gaaga’ama ongee Booranaa barsiifata haaraaf ka’umsa ta’e", "summary": ""},
    {"title": "Abjuu qoqqooddotaa tokkummaan maseensuu", "summary": ""},
    {"title": "Misoomni koriidarii Finfinnee dhaloota egeree ilaalcha keessa kan galcheedha", "summary": "Finfinnee: Waamichi komishinii marii biyyaalessaa murnoota karaa seeraan alaa hidhatanii socho’aniif dhiyeesse marii aadaa taasisuuf shoora olaanaa qaba jechuun Komishiniin Marii biyyaalessaa ibse. Komishinarri ittaanaan komishinichaa Doktar Yoonaas Addaayee ibsa Kamisa darbe..."},
    {"title": "Oromiyaatti jijjiiramaa as barnoota cimsuuf qarshii biliyoona 106 ol baasii ta’eera", "summary": "Adaamaa: Sagantaan sosochii Industirii Manifaakchariingii mata duree ‘Itoophiyaan haa omishtu nutis haa binnu’ jedhuun Kibxata darbe Adaamaa, Galma Abbaa Gadaatti adeemsifameera. Waltajjicharratti hoggantoonni sektaroota invastimantiifi industirii mootummaa naannoo Oromiyaafi federaalaa akkasumas qooda..."},
    {"title": "Biiroon Daldalaa Oromiyaa qaala’iinsa gatii ittisuuf qophii taasise", "summary": ""},
    {"title": "Gaaga’ama ongee Booranaa barsiifata haaraaf ka’umsa ta’e", "summary": ""},
    {"title": "Misoomni koriidarii Finfinnee dhaloota egeree ilaalcha keessa kan galcheedha", "summary": "Finfinnee: Waamichi komishinii marii biyyaalessaa murnoota karaa seeraan alaa hidhatanii socho’aniif dhiyeesse marii aadaa taasisuuf shoora olaanaa qaba jechuun Komishiniin Marii biyyaalessaa ibse. Komishinarri ittaanaan komishinichaa Doktar Yoonaas Addaayee ibsa Kamisa darbe..."},
    {"title": "Biiroon Daldalaa Oromiyaa qaala’iinsa gatii ittisuuf qophii taasise", "summary": ""},
    {"title": "Buunyaa: Akaakuu ispoortii Itoophiyaatti xiyyeeffannaa fedhu", "summary": "Finifinnee: Afrikaa Kibbaa, magaalaa Darbaanitti dorgommii yaadannoo pirezidaantii duraanii biyyattii, Maandeellaaf qophaa’erratti hirmaachuudhaan Kibxata darbe gara biyyaatti kan deebi’e jila Buunyaa Itoophiyaaf simannaan taasifameera. Dorgommii Ebla 8 hanga 13 bara 2016tti adeemsifame..."},
    {"title": "Torbee injifannoo atileetota keenyaa", "summary": ""},
    {"title": "Istaadiyeemii Intarnaashinaalii Aqaaqii:", "summary": "Finfinnee: Dorgommiiwwan atileetiksi torban kana biyyoota adda addaatti adeemsifamanitti atileetonni keenya injifannoo olaanaa gonfataniiru. Dorgommii maaraatonii Ostiriyaa, Magaalaa Veenaatti adeemsifameen Dhiiran atileeti Caalaa Raggaasaa sa’aatii 2:06.35n tokkoffaa ba’un mo’ateera. Fiigicha meetira kuma..."},
    {"title": "Fiigichi Itoophiyaan haa omishtuu boru adeemsifama", "summary": ""},
    {"title": "Taphawwan guutuu Oromiyaarratti hirmaannaa godinaalee", "summary": "Miseensonni jila Ispoortii aadaa naannawaa biyya keenyaa mara irraa walitti dhufan turtiisaanii Finfinneen tattaaffii duudhaalee keenya gaarii ijaaruuf taasisaniif nigalateeffanna. Jilichi iddoo oolmaa ispoortiifi giddugala ijaarsa namummaa dargaggootaa hundeessuudhaan dargaggoonni kennaa dandeetti..."},
    {"title": "Taphni guutuu Oromiyaa Jimmatti adeemsifamaa jira", "summary": ""},
    {"title": "Injifannoon atileetonni Itoophiyaa galmeessisaa jiran Olompikii Paariisiif galteedha", "summary": "Finfinnee: Fiigichi kiiloo meetira kudhanii Itoophiyaan haa omishtuu yeroo lammaffaaf boru Finfinneetti adeemsifama. Ministir De’eetaan Minsteera Industirii Obbo Taarraqany Bulultaa ibsa Roobii darbe waajjirasaaniitti gaazexeessitootaaf kennaniin akka jedhanitti, dorgommiin atileetiksii kiiloomeetira 10..."},
    {"title": "“Dorgommii qaxxaamura biyyaarraa barumsa arganneerra”", "summary": ""},
    {"title": "Komiishinara Gargaartuu Daraartuu Tulluu badhaafamte", "summary": "Jimma: Taphiwwan guutuu Oromiyaa magaalaa Jimmaatti Ebla 6 bara 2016 irraa kaasee adeemsifamaa jira. Shaampiyoonaa yeroo 26ffaaf adeemsifamaa jiru kanarratti godinaaleefi bulchiinsonni magaalota naannichaa hirmaachaa jiru. Godinaalee shaampiyoonicharratti hirmaachaa jiran keessaa Godinni..."},
    {"title": "Dorgommiin intarnaashinaalii Buunyaa boru gaggeeffama", "summary": ""},
    {"title": "Sababiin malaammaltummaa maali?", "summary": "Gaaffii kanaaf namoonni deebii hedduu kennu. Baay’een qorannoowwan gara garaa dubbisuun tarii sababiin malaammaltummaa mootummaadha jedhu. Kaanis haala jirutu akka malaammaltummaan dagaage taasise jedhanii yaadu. Namni tokko Hiindiitii kan inni deebise isaan..."},
    {"title": "", "summary": ""},
    {"title": "Milkaa’inni carraa otoo hintaane hojiidhaan dhufa", "summary": "Jalqaba jaarraa 19ffaa keessa biyya Beeljiyeemitti mucaan maqaan isaa Adoolfi Saaksi (Adolphe Sax) jedhamu tokko dhalate. Mucaan kun namoota biyya lafaa kana irratti dhalatan hundumaa caalaa nama milkii hinqabne, nama rakkoof dhalate..."},
    {"title": "Ilaalchi mo’amaan utuu hineegaliin nama kuffisa", "summary": ""},
    {"title": "Dhoksaa namoota jijjiiramaa", "summary": "Milkaa’ina namoonni hundi nibarbaadu. Haa ta’u malee milkaa’inni maali? Attamitti gonfatama? Eenyutu milkaa’a? Gaaffiilee kanneeniifi kkfn hedduun keenya danqamuu dandeenya. Milkaa’inni jabaatanii hojjechuun malee akka ayyaanaa akka tasaa kan nama irra qubatu,..."},
    {"title": "Aariirraa of eeguu", "summary": ""},
    {"title": "Ulfa baasuun daqiiqaa muraasa; gaabbiin isaa kan bara baraati", "summary": "Namni hundumtuu darbee darbee yeroo ofitti amanamummaa dhabu, waa’een ofii isaatii waan gaariin yeroo itti dhaga’amuu didu ni jiraata. Jireenyi akkasii yeroo oolee bulu amala namaa dhuunfachaa deemuun gara dhukkuba sammuutti nama..."},
    {"title": "Teknolojii intarneetii", "summary": ""},
    {"title": "Karoora qabaadhu!", "summary": "Yeroo waa’een jijjiiramaa ka’u namoonni akka Roozaa Paarki ni yaadatamu jedheen yaada. Yeroo namoonni namummaa isaaniin utuu hinta’in bifa gogaa isaanii irratti hundaa’uun gadi qabamaa turan keessatti nama mataa jabaattee haala firoottan..."},
    {"title": "Gaggeessaa dhiibbaa gaarii uumu", "summary": ""}
    ]